# -*- coding: utf-8 -*-

import unittest
import words

TEST_DIGITS = [
    ["один", 1],
    ["один два", 12],
    ["сто два", 102],
    ["один ноль два", 102],
    ["один ноль десять", 1010],
    ["три четыре пять", 345],
    ["сто одиннадцать", 111],
    ["пятьдесят двадцать", 5020],
    ["один ноль шесть", 106],
    #["один два ноля шесть", 1006],
    ["двадцать два двадцать два", 2222],
    #["три пять нолей ноль", 3000000],
    ["пять тысяч", 5000],
    ["двадцать шесть тысяч", 26000],
    ["одна тысяча два", 1002],
    ["тысяча два", 1002],
    ["тысяча тридцать", 1030],
    ["сто тысяч", 100000],
    ["пять тысяч сто одиннадцать", 5111],
    ["восемь тысяч десять", 8010],
    ["три сотни восемнадцать", 318],
    ["семьсот тридцать два", 732],
    ["сто пятьсот", 100500],
    ["восемьсот восемнадцать семьдесят четыре сорок восемь", 8187448],
    ["три сотни миллионов тысяч", 300000000000],
    ["миллион сто", 1000100],
    ["две тысячи сто сорок три сотни", 214300],
    ["сто двадцать семь двести девяносто два", 127292],
    ["сто двадцать семь двести девяносто два восемнадцать", 12729218],
    ["одиннадцать сто двадцать семь двести девяносто два", 11127292],
    ["миллион миллион", 10000001000000]
]


class MyTestCase(unittest.TestCase):
    def test_digits(self):
        for value in TEST_DIGITS:
            self.assertEqual(
                words.convert(value[0]), value[1],
                "Error: {0} vs {1}".format(value[0],
                                           words.convert(value[0])))


if __name__ == '__main__':
    unittest.main()
