# -*- coding: utf-8 -*-

import unittest
import words

TEST_DIGITS = [
    [u"один", 1],
    [u"один два", 12],
    [u"сто два", 102],
    [u"один ноль два", 102],
    [u"один ноль десять", 1010],
    [u"три четыре пять", 345],
    [u"сто одиннадцать", 111],
    [u"пятьдесят двадцать", 5020],
    [u"один ноль шесть", 106],
    [u"один два ноля шесть", 1006],
    [u"двадцать два двадцать два", 2222],
    [u"три пять нолей ноль", 3000000],
    [u"пять тысяч", 5000],
    [u"двадцать шесть тысяч", 26000],
    [u"одна тысяча два", 1002],
    [u"тысяча два", 1002],
    [u"тысяча тридцать", 1030],
    [u"сто тысяч", 100000],
    [u"пять тысяч сто одиннадцать", 5111],
    [u"восемь тысяч десять", 8010],
    [u"три сотни восемнадцать", 318],
    [u"семьсот тридцать два", 732],
    [u"сто пятьсот", 100500],
    [u"восемьсот восемнадцать семьдесят четыре сорок восемь", 8187448],
    [u"три сотни миллионов тысяч", 300000000000],
    [u"миллион сто", 1000100],
    [u"две тысячи сто сорок три сотни", 214300],
    [u"сто двадцать семь двести девяносто два", 127292],
    [u"сто двадцать семь двести девяносто два восемнадцать", 12729218],
    [u"одиннадцать сто двадцать семь двести девяносто два", 11127292],
    [u"миллион миллион", 10000001000000],
    [u"миллион тысяча тридцать", 1001030],
    [u"пять единиц две семерки", 1111177],
    [u"один три нуля", 1000],
    [u'5 единиц 2 семерки', 1111177]
]


class MyTestCase(unittest.TestCase):
    def test_digits(self):
        for value in TEST_DIGITS:
            self.assertEqual(
                words.convert(value[0]), value[1],
                u"Error: {0} vs {1}".format(value[0],
                                           words.convert(value[0])))


if __name__ == '__main__':
    unittest.main()
